# Lab Experiment 03: Pandas Operations

## 1. Introduction
In this notebook, we will learn about advanced Pandas operations such as merging, joining, and concatenating DataFrames. We will cover:
- Creating DataFrames from dictionaries
- Concatenating DataFrames
- Merging DataFrames (Inner, Outer, Left, Right)
- Joining DataFrames
- Applying custom functions

In [ ]:
import pandas as pd

raw_data_1 = {
    "subject_id": ["1", "2", "3", "4", "5"],
    "first_name": ["Alex", "Amy", "Allen", "Alice", "Ayoung"],
    "last_name": ["Anderson", "Ackerman", "Ali", "Aoni", "Atiches"],
}

raw_data_2 = {
    "subject_id": ["4", "5", "6", "7", "8"],
    "first_name": ["Billy", "Brian", "Bran", "Bryce", "Betty"],
    "last_name": ["Bonder", "Black", "Balwner", "Brice", "Bistan"],
}

raw_data_3 = {
    "subject_id": ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"],
    "test_id": [51, 15, 15, 61, 16, 14, 15, 1, 61, 16, 1],
}

## 2. Creating DataFrames
First, let's create some sample DataFrames to work with.

In [ ]:
raw_data_1 = pd.DataFrame(raw_data_1)
raw_data_2 = pd.DataFrame(raw_data_2)
raw_data_3 = pd.DataFrame(raw_data_3)

In [ ]:
pd.concat([raw_data_1, raw_data_3], axis=1)[
    ["subject_id", "first_name", "last_name", "test_id"]
].head(1)

  subject_id subject_id first_name last_name  test_id
0          1          1       Alex  Anderson       51

## 3. Concatenation
Concatenation combines DataFrames along a particular axis (rows or columns).

In [ ]:
raw_data_1.merge(raw_data_3, on="subject_id", how="inner").head(1)

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51

## 4. Merging DataFrames
Merging is used to combine DataFrames based on common columns or indices, similar to SQL joins.
### Inner Merge
Returns only the rows where there is a match in both DataFrames.

In [ ]:
raw_data_1.merge(raw_data_3, on="subject_id", how="left")

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          5     Ayoung   Atiches       16

### Left Merge
Returns all rows from the left DataFrame and the matched rows from the right DataFrame.

In [ ]:
raw_data_1.merge(raw_data_3, on="subject_id", how="right")

   subject_id first_name last_name  test_id
0           1       Alex  Anderson       51
1           2        Amy  Ackerman       15
2           3      Allen       Ali       15
3           4      Alice      Aoni       61
4           5     Ayoung   Atiches       16
5           6        NaN       NaN       14
6           7        NaN       NaN       15
7           8        NaN       NaN        1
8           9        NaN       NaN       61
9          10        NaN       NaN       16
10         11        NaN       NaN        1

### Right Merge
Returns all rows from the right DataFrame and the matched rows from the left DataFrame.

In [ ]:
raw_data_1.merge(raw_data_3, on="subject_id", how="outer")

   subject_id first_name last_name  test_id
0           1       Alex  Anderson       51
1          10        NaN       NaN       16
2          11        NaN       NaN        1
3           2        Amy  Ackerman       15
4           3      Allen       Ali       15
5           4      Alice      Aoni       61
6           5     Ayoung   Atiches       16
7           6        NaN       NaN       14
8           7        NaN       NaN       15
9           8        NaN       NaN        1
10          9        NaN       NaN       61

### Outer Merge
Returns all rows when there is a match in either left or right DataFrame.

In [ ]:
# print(raw_data_1,head())
# print('---------')
# print(raw_data_3.head())

raw_data_1.merge(raw_data_2, on=["subject_id", "first_name", "last_name"], how="outer")

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          4      Billy    Bonder
5          5     Ayoung   Atiches
6          5      Brian     Black
7          6       Bran   Balwner
8          7      Bryce     Brice
9          8      Betty    Bistan

In [ ]:
raw_data_1.merge(raw_data_2, on="subject_id", how="outer")

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Bistan

In [ ]:
pd.concat([raw_data_1, raw_data_2]).sort_values(by="subject_id")

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
0          4      Billy    Bonder
4          5     Ayoung   Atiches
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Bistan

In [ ]:
# merge all data

In [ ]:
raw_data_1.set_index("last_name", inplace=True)

## 5. Joining DataFrames
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame. It defaults to joining on the index.

In [13]:
raw_data_1

          subject_id first_name
last_name
Anderson           1       Alex
Ackerman           2        Amy
Ali                3      Allen
Aoni               4      Alice
Atiches            5     Ayoung

In [ ]:
raw_data_2.set_index("last_name", inplace=True)

In [15]:
raw_data_2

          subject_id first_name
last_name
Bonder             4      Billy
Black              5      Brian
Balwner            6       Bran
Brice              7      Bryce
Bistan             8      Betty

In [ ]:
raw_data_3.set_index("subject_id", inplace=True)

In [17]:
raw_data_3

            test_id
subject_id
1                51
2                15
3                15
4                61
5                16
6                14
7                15
8                 1
9                61
10               16
11                1

In [ ]:
raw_data_1.join(raw_data_2, how="inner", lsuffix="_1", rsuffix="_2")

Empty DataFrame
Columns: [subject_id_1, first_name_1, subject_id_2, first_name_2]
Index: []

In [19]:
len(raw_data_1.first_name)

5

In [ ]:
raw_data_1.join(raw_data_2, how="inner", lsuffix="_1", rsuffix="_2")

Empty DataFrame
Columns: [subject_id_1, first_name_1, subject_id_2, first_name_2]
Index: []

In [ ]:
raw_data_1["last_name_total_alphabets"] = raw_data_1.last_name.apply(len)

AttributeError: 'DataFrame' object has no attribute 'last_name'

## 6. Applying Functions
We can use the `apply()` method to apply a function along an axis of the DataFrame.

In [ ]:
def check(x):
    if x > 5:
        return "High"
    else:
        return "less"

In [23]:
raw_data_1

          subject_id first_name
last_name
Anderson           1       Alex
Ackerman           2        Amy
Ali                3      Allen
Aoni               4      Alice
Atiches            5     Ayoung